; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-20)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room5)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at ball20 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room6)
(at ball2 room6)
(at ball3 room6)
(at ball4 room6)
(at ball5 room6)
(at ball6 room6)
(at ball7 room6)
(at ball8 room6)
(at ball9 room6)
(at ball10 room6)
(at ball11 room6)
(at ball12 room6)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at ball20 room6)
)
)
)

; plan
1. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 5 of 20
2. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 5 of 20
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 20
4. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 5 of 20
5. (drop ball1 room6 right)
   deleted: (carry ball1 right)
   added: (at ball1 room6) (free right)
   goals met: 6 of 20
6. (drop ball2 room6 left)
   deleted: (carry ball2 left)
   added: (at ball2 room6) (free left)
   goals met: 7 of 20
7. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 7 of 20
8. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 7 of 20
9. (pick ball5 roomb right)
   deleted: (at ball5 roomb) (free right)
   added: (carry ball5 right)
   goals met: 7 of 20
10. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 7 of 20
11. (drop ball5 room6 right)
   deleted: (carry ball5 right)
   added: (at ball5 room6) (free right)
   goals met: 8 of 20
12. (drop ball6 room6 left)
   deleted: (carry ball6 left)
   added: (at ball6 room6) (free left)
   goals met: 9 of 20
13. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 9 of 20
14. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 9 of 20
15. (pick ball3 roomb right)
   deleted: (at ball3 roomb) (free right)
   added: (carry ball3 right)
   goals met: 9 of 20
16. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 9 of 20
17. (drop ball3 room6 right)
   deleted: (carry ball3 right)
   added: (at ball3 room6) (free right)
   goals met: 10 of 20
18. (drop ball4 room6 left)
   deleted: (carry ball4 left)
   added: (at ball4 room6) (free left)
   goals met: 11 of 20
19. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 11 of 20
20. (pick ball15 room5 left)
   deleted: (at ball15 room5) (free left)
   added: (carry ball15 left)
   goals met: 11 of 20
21. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 11 of 20
22. (drop ball15 room6 left)
   deleted: (carry ball15 left)
   added: (at ball15 room6) (free left)
   goals met: 12 of 20
23. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 12 of 20
24. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 12 of 20
25. (pick ball13 room4 right)
   deleted: (at ball13 room4) (free right)
   added: (carry ball13 right)
   goals met: 12 of 20
26. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 12 of 20
27. (drop ball13 room6 right)
   deleted: (carry ball13 right)
   added: (at ball13 room6) (free right)
   goals met: 13 of 20
28. (drop ball14 room6 left)
   deleted: (carry ball14 left)
   added: (at ball14 room6) (free left)
   goals met: 14 of 20
29. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 14 of 20
30. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 14 of 20
31. (pick ball11 room4 right)
   deleted: (at ball11 room4) (free right)
   added: (carry ball11 right)
   goals met: 14 of 20
32. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 14 of 20
33. (drop ball11 room6 right)
   deleted: (carry ball11 right)
   added: (at ball11 room6) (free right)
   goals met: 15 of 20
34. (drop ball12 room6 left)
   deleted: (carry ball12 left)
   added: (at ball12 room6) (free left)
   goals met: 16 of 20
35. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 16 of 20
36. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 16 of 20
37. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 16 of 20
38. (drop ball10 room6 left)
   deleted: (carry ball10 left)
   added: (at ball10 room6) (free left)
   goals met: 17 of 20
39. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 17 of 20
40. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 17 of 20
41. (pick ball8 room3 right)
   deleted: (at ball8 room3) (free right)
   added: (carry ball8 right)
   goals met: 17 of 20
42. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 17 of 20
43. (drop ball8 room6 right)
   deleted: (carry ball8 right)
   added: (at ball8 room6) (free right)
   goals met: 18 of 20
44. (drop ball9 room6 left)
   deleted: (carry ball9 left)
   added: (at ball9 room6) (free left)
   goals met: 19 of 20
45. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 19 of 20
46. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 19 of 20
47. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 19 of 20
48. (drop ball7 room6 left)
   deleted: (carry ball7 left)
   added: (at ball7 room6) (free left)
   goals met: 20 of 20
